### pandas - Dataframe
- 2차원 행렬(표), Serise를 묶어낸 자료형

In [239]:
import numpy as np
import pandas as pd

In [240]:
# dictionary-list 활용
data={
    'one': [1,2,3,4,5],
    'two':['가','나','다','라','마'],
    'three':[1.23,2.34,3.45,4.56,5.67],
    'four': True
}

df=pd.DataFrame(data)
df

   one two  three  four
0    1   가   1.23  True
1    2   나   2.34  True
2    3   다   3.45  True
3    4   라   4.56  True
4    5   마   5.67  True

In [241]:
# list-dictionary 활용
data = [
    {'a': 1, 'b': 2, 'c': 3},
    {'b': 5, 'c': 6},
    {'a': 7, 'b': 8, 'c': 9}
]

df = pd.DataFrame(data)


df.index = ['토끼', '판다', '코알라']
print(df.index)

df.columns = ['협동심', '성실도', '인내심']

print(df.columns)
df

Index(['토끼', '판다', '코알라'], dtype='object')
Index(['협동심', '성실도', '인내심'], dtype='object')

     협동심  성실도  인내심
토끼   1.0    2    3
판다   NaN    5    6
코알라  7.0    8    9

In [242]:
# 2차원 ndarray 활용

arr = np.random.randn(2, 3)
df = pd.DataFrame(arr, index=['ㄱ', 'ㄴ'], columns=['A', 'B', 'C'])

# df.index = ['ㄱ', 'ㄴ']
# df.columns = ['A', 'B', 'C']
df

          A         B         C
ㄱ  0.348665  1.555867 -0.673752
ㄴ  1.800402 -0.381035 -0.253358

In [243]:
data = {
    '이름': ['토끼', '판다', '유니콘'],
    '위치': ['독산', '종로', '천호'],
    '성별': ['F','F','M']
}

df = pd.DataFrame(data)
df = pd.DataFrame(data, index=['rabbit', 'panda', 'unicorn'])
df

          이름  위치 성별
rabbit    토끼  독산  F
panda     판다  종로  F
unicorn  유니콘  천호  M

In [244]:
# 전치행렬 (행과 열을 바꿈)
df.T

   rabbit panda unicorn
이름     토끼    판다     유니콘
위치     독산    종로      천호
성별      F     F       M

---

##### DataFrame 속성

In [245]:
print(df.index)
print(df.columns)
print(df.values)

Index(['rabbit', 'panda', 'unicorn'], dtype='object')
Index(['이름', '위치', '성별'], dtype='object')
[['토끼' '독산' 'F']
 ['판다' '종로' 'F']
 ['유니콘' '천호' 'M']]

In [246]:
print(df.shape) # 형태
print(df.size)  # 요소개수
print(df.ndim)  # 깊이
print(df.dtypes)# 요소의 자료형

(3, 3)
9
2
이름    object
위치    object
성별    object
dtype: object

---

##### DataFrame 메소드

In [247]:
bank_client_df = pd.DataFrame({
    'Client ID': [1, 2, 3, 4],
    'Client Name': ['Aly', 'Steve', 'Nicole', 'Morris'],
    'Net worth [$]': [35000, 3000, 100000, 2000],
    'Years with bank': [4, 7, 10, 15]
})

bank_client_df

   Client ID Client Name  Net worth [$]  Years with bank
0          1         Aly          35000                4
1          2       Steve           3000                7
2          3      Nicole         100000               10
3          4      Morris           2000               15

In [248]:
print(bank_client_df.head(2))
print(bank_client_df.tail(2))

   Client ID Client Name  Net worth [$]  Years with bank
0          1         Aly          35000                4
1          2       Steve           3000                7
   Client ID Client Name  Net worth [$]  Years with bank
2          3      Nicole         100000               10
3          4      Morris           2000               15

In [249]:
bank_client_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Client ID        4 non-null      int64
 1   Client Name      4 non-null      object
 2   Net worth [$]    4 non-null      int64
 3   Years with bank  4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 260.0+ bytes

In [250]:
bank_client_df.describe()

       Client ID  Net worth [$]  Years with bank
count   4.000000       4.000000         4.000000
mean    2.500000   35000.000000         9.000000
std     1.290994   45963.753836         4.690416
min     1.000000    2000.000000         4.000000
25%     1.750000    2750.000000         6.250000
50%     2.500000   19000.000000         8.500000
75%     3.250000   51250.000000        11.250000
max     4.000000  100000.000000        15.000000

In [251]:
bank_client_df

   Client ID Client Name  Net worth [$]  Years with bank
0          1         Aly          35000                4
1          2       Steve           3000                7
2          3      Nicole         100000               10
3          4      Morris           2000               15

In [252]:
# indexing / slicing
# iloc 인덱스 - 행/열 순서로 조회
# loc 라벨 - 행/열 순서로 조회
print(bank_client_df.iloc[0])
print(type(bank_client_df.iloc[0]))
print(type(bank_client_df.iloc[0].index))
print(type(bank_client_df.iloc[0].name))

Client ID              1
Client Name          Aly
Net worth [$]      35000
Years with bank        4
Name: 0, dtype: object
<class 'pandas.core.series.Series'>
<class 'pandas.core.indexes.base.Index'>
<class 'int'>

In [253]:
bank_client_df.iloc[:2], type(bank_client_df.iloc[:2])

(   Client ID Client Name  Net worth [$]  Years with bank
 0          1         Aly          35000                4
 1          2       Steve           3000                7,
 pandas.core.frame.DataFrame)

In [254]:
bank_client_df.iloc[[0,2]],type(bank_client_df.iloc[[0,2]])

(   Client ID Client Name  Net worth [$]  Years with bank
 0          1         Aly          35000                4
 2          3      Nicole         100000               10,
 pandas.core.frame.DataFrame)

In [255]:
# fancy indexing을 통한 조회는 결과가 1개여도 DataFrame 타입으로 반환
# -> Series를 반환한다는 것은 차원을 축소(제거)하는 것
# -> DataFrame을 반환한다는 것은 차원을 유지하는 것
print(bank_client_df.iloc[[2]].shape)
print(bank_client_df.iloc[2].shape)
bank_client_df.iloc[[2]], type(bank_client_df.iloc[[2]])

(1, 4)
(4,)

(   Client ID Client Name  Net worth [$]  Years with bank
 2          3      Nicole         100000               10,
 pandas.core.frame.DataFrame)

In [256]:
# 2차원 indexing/slicing
bank_client_df.iloc[0,1]

'Aly'

In [257]:
bank_client_df.iloc[:2,1],type(bank_client_df.iloc[:2,1])

(0      Aly
 1    Steve
 Name: Client Name, dtype: object,
 pandas.core.series.Series)

In [258]:
bank_client_df.iloc[:2,2:],type(bank_client_df.iloc[:2,2:])

(   Net worth [$]  Years with bank
 0          35000                4
 1           3000                7,
 pandas.core.frame.DataFrame)

In [259]:
bank_client_df.index=['client1','client2','client3','client4']

bank_client_df

         Client ID Client Name  Net worth [$]  Years with bank
client1          1         Aly          35000                4
client2          2       Steve           3000                7
client3          3      Nicole         100000               10
client4          4      Morris           2000               15

In [260]:
bank_client_df.loc['client3']

Client ID               3
Client Name        Nicole
Net worth [$]      100000
Years with bank        10
Name: client3, dtype: object

In [261]:
bank_client_df.iloc[1:3]

         Client ID Client Name  Net worth [$]  Years with bank
client2          2       Steve           3000                7
client3          3      Nicole         100000               10

In [262]:
# bank_client_df.loc['client2':'client4']
bank_client_df.loc['client2':'client4':2]

         Client ID Client Name  Net worth [$]  Years with bank
client2          2       Steve           3000                7
client4          4      Morris           2000               15

In [263]:
bank_client_df.loc['client2':'client4':2], type(bank_client_df.loc['client2':'client4':2])

(         Client ID Client Name  Net worth [$]  Years with bank
 client2          2       Steve           3000                7
 client4          4      Morris           2000               15,
 pandas.core.frame.DataFrame)

In [264]:
bank_client_df.loc['client2':'client4':2,'Client Name'], type(bank_client_df.loc['client2':'client4':2,'Client Name'])

(client2     Steve
 client4    Morris
 Name: Client Name, dtype: object,
 pandas.core.series.Series)

In [265]:
bank_client_df.loc['client2':'client4':2,'Client Name':'Net worth [$]'], type(bank_client_df.loc['client2':'client4':2,'Client Name':'Net worth [$]'],)

(        Client Name  Net worth [$]
 client2       Steve           3000
 client4      Morris           2000,
 pandas.core.frame.DataFrame)

In [266]:
bank_client_df.loc['client2':'client4':2,['Client Name','Years with bank']]

        Client Name  Years with bank
client2       Steve                7
client4      Morris               15

In [267]:
# 이름이 Steve인 고객 정보 출력

bank_client_df[bank_client_df['Client Name']=='Steve']

         Client ID Client Name  Net worth [$]  Years with bank
client2          2       Steve           3000                7

In [268]:
# Client Name 만 출력
bank_client_df['Client Name']

client1       Aly
client2     Steve
client3    Nicole
client4    Morris
Name: Client Name, dtype: object

In [269]:
# Client Name과 Net worth [$] 출력

bank_client_df[['Client Name','Net worth [$]']]

        Client Name  Net worth [$]
client1         Aly          35000
client2       Steve           3000
client3      Nicole         100000
client4      Morris           2000

In [270]:
# filter
bank_client_df.filter(items=['Client Name','Net worth [$]'])

        Client Name  Net worth [$]
client1         Aly          35000
client2       Steve           3000
client3      Nicole         100000
client4      Morris           2000

In [271]:
bank_client_df.filter(like='$',axis=1)

         Net worth [$]
client1          35000
client2           3000
client3         100000
client4           2000

In [272]:
bank_client_df.filter(like='4',axis=0)

         Client ID Client Name  Net worth [$]  Years with bank
client4          4      Morris           2000               15

In [273]:
students = [
    {'name': '호랑이', 'midterm': 95, 'final': 85},
    {'name': '늑대', 'midterm': 93, 'final': 90},
    {'name': '양', 'midterm': 100, 'final': 10}
]

df=pd.DataFrame(students)

In [274]:
# 행 추가 1. loc 이용
df.loc[len(df)]=['하마',88,72]
df

  name  midterm  final
0  호랑이       95     85
1   늑대       93     90
2    양      100     10
3   하마       88     72

In [275]:
# 행 추가 2. pd.concat() 이용 : DataFrame 병합
add_student_df=pd.DataFrame([['곰',99,24]],columns=['name','midterm','final'])
pd.concat([df,add_student_df],ignore_index=True)

  name  midterm  final
0  호랑이       95     85
1   늑대       93     90
2    양      100     10
3   하마       88     72
4    곰       99     24

In [276]:
# 행 삭제
# index 이용
# df=df.drop(df.index[0])
df.drop(df.index[[0]],inplace=True)
df

  name  midterm  final
1   늑대       93     90
2    양      100     10
3   하마       88     72

---

##### 컬럼 추가

In [277]:
df = pd.DataFrame({
    '이름': ['토끼', '판다', '유니콘'],
    '위치': ['독산', '종로', '천호'],
    '성별': ['F','F','M']
})

In [278]:
# 컬럼명 이용
df['취미']='인공지능 공부'
df

    이름  위치 성별       취미
0   토끼  독산  F  인공지능 공부
1   판다  종로  F  인공지능 공부
2  유니콘  천호  M  인공지능 공부

In [280]:
# 컬럼명과 np.where(조건, True일 때 값, False일 때 값) -> ndarray 이용
df['성별(한글)'] = np.where(df['성별'] == 'M', '남성', '여성')
df

    이름  위치 성별       취미 성별(한글)
0   토끼  독산  F  인공지능 공부     여성
1   판다  종로  F  인공지능 공부     여성
2  유니콘  천호  M  인공지능 공부     남성

In [283]:
df = pd.DataFrame({
    '이름': ['토끼', '판다', '유니콘'],
    '위치': ['독산', '종로', '천호'],
    '성별': ['F', 'F', 'M'],
    '키': [179, 165, 157],
    '체중': [50.1, 48.2, 51.3]
})

In [284]:
# 컬럼명과 기존 컬럼 연산 이용
df['BMI'] = df['체중'] / ((df['키'] * 0.01) ** 2)  # BMI = kg / m^2
df

    이름  위치 성별    키    체중        BMI
0   토끼  독산  F  179  50.1  15.636216
1   판다  종로  F  165  48.2  17.704316
2  유니콘  천호  M  157  51.3  20.812203